markdownOutput/work_notes/20250922085357-rsc_rpt.md

# Table of Contents

1.  [Question for 250923 Meeting](#orgfa5d591)
    1.  [Gradesheet](#org4ab1219)
        1.  [What you think the ask is (ideas/concepts would be helpful)](#org0c38b41)
        2.  [How you think you will accomplish the initiative (include multiple COAs if appropriate)](#org70b01b8)
        3.  [Estimated time to complete the initiative](#orga963d07)
        4.  [What resources you need to start work on the initiative](#org6c40cdd)
        5.  [Questions you have that preclude answers to the above](#org5fe3f54)
    2.  [Dashboard](#orgce274f6)
        1.  [What you think the ask is (ideas/concepts would be helpful)](#org5eb94ef)
        2.  [How you think you will accomplish the initiative (include multiple COAs if appropriate)](#orga532ce1)
        3.  [Estimated time to complete the initiative](#orgc7fcf43)
        4.  [Questions you have that preclude answers to the above](#org9f8fc35)



<a id="orgfa5d591"></a>

# Question for 250923 Meeting


<a id="org4ab1219"></a>

## [Gradesheet](20250919161110-gradesheet.md)


<a id="org0c38b41"></a>

### What you think the ask is (ideas/concepts would be helpful)

1.  To create a user defined [Gradesheet](20250919161110-gradesheet.md).

2.  This needs to be able to be nearly 100% customizable

3.  Ability ot choose num/denom

4.  Be more than a reporting tool

    1.  Ability to dive into stats easily to help epxlain the &rsquo;whys&rsquo;

5.  Exportable data

    1.  PDF/Excel formatting. Excel 4 their own viz, PDF for ours

6.  Dataset query

7.  Answers coming from WSD

    **\*\***


<a id="org70b01b8"></a>

### How you think you will accomplish the initiative (include multiple COAs if appropriate)

1.  MVP

    1.  Numerator Demoninator choice
    
    2.  Customizable field additions
    
    3.  Ability to move around the &rsquo;metrics&rsquo;
    
    4.  Dataset addiiton

2.  Phase 1

    1.  Diving into the &rsquo;why&rsquo;
    
    2.  Picking the metric, and expandables that dive into the stats

3.  Phase 2

    1.  More indepth metrics.
    
    2.  NTA/Skills/MOE/MOP
    
    3.  &rsquo;Possible&rsquo; Adding &rsquo;math&rsquo; into the metrics
    
        1.  QUESTION : &rsquo;math&rsquo; needs to be though about. LIkely is meaning something along the lines more of logic within the metric itself? More of an || && type of thing rather than a + - x / type of math.

4.  Phase 3+

    1.  TBD, as time proceeds and more ideas flush through.


<a id="orga963d07"></a>

### Estimated time to complete the initiative

1.  MVP - 1-1.5 months (err on the side of 2)

2.  Phase 1 - early 2026

3.  Phase 3 - Unsure with a few of the metrics. Can estimate Q2 2026?


<a id="org6c40cdd"></a>

### What resources you need to start work on the initiative

1.  None to start.

2.  For Phase 3, there will be a lot of collaboration with the WSD and Analytics team. This is mainly for how rigorous and built up the MOE/MOP/NTA/Skills are. Talking with Puffy, currently they are more mature than i initially thought. But we need to get a plan of attack in order to make sure it is flushed out.


<a id="org5fe3f54"></a>

### Questions you have that preclude answers to the above

1.  N/A


<a id="orgce274f6"></a>

## [Dashboard](20250922091645-dashboard.md)


<a id="org5eb94ef"></a>

### What you think the ask is (ideas/concepts would be helpful)

1.  to create a user defined dashbaord that a user can define the layout.

2.  Also to be able ot create user defined plots, with a preview

3.  Plots to be able ot be used throughout RAPID

4.  Have it similar to what BI tools are, but for RAPID users

    1.  This means easier to use, and more tailored experience so there is a smaller learning curve.


<a id="orga532ce1"></a>

### How you think you will accomplish the initiative (include multiple COAs if appropriate)

1.  MVP is completed

    1.  MVp included the ability to create the dashboad and custom plots.

2.  Phase 1 is underway

    1.  More plots to be able to be used
    
    2.  Also ability for more customizaiton with the plots

3.  Phase 2 is TBD


<a id="orgc7fcf43"></a>

### Estimated time to complete the initiative

1.  Mostly completed

2.  Phase 1+ is underway. Plots include Bubble, Heatmap, Contours.

    1.  Phase 1+ also includes imporoved filtering for dropdowns
    
    2.  What is needed here is more understanding on the databases/marker structure. Which I am getting from Standards via Andy.


<a id="org9f8fc35"></a>

### Questions you have that preclude answers to the above

1.  N/A

